import random

capitals = {'北海道': '札幌市', '青森県': '青森市', '岩手県': '盛岡市',
  '宮城県': '仙台市', '秋田県': '秋田市', '山形県': '山形市', '福島県': '福島市',
  '茨城県': '水戸市', '栃木県': '宇都宮市', '群馬県': '前橋市',
  '埼玉県': 'さいたま市', '千葉県': '千葉市', '東京都': '東京',
  '神奈川県': '横浜市', '新潟県': '新潟市', '富山県': '富山市', '石川県': '金沢市',
  '福井県': '福井市', '山梨県': '甲府市', '長野県': '長野市', '岐阜県': '岐阜市',
  '静岡県': '静岡市', '愛知県': '名古屋市', '三重県': '津市', '滋賀県': '大津市',
  '京都府': '京都市', '大阪府': '大阪市', '兵庫県': '神戸市', '奈良県': '奈良市',
  '和歌山県': '和歌山市', '鳥取県': '鳥取市', '島根県': '松江市',
  '岡山県': '岡山市', '広島県': '広島市', '山口県': '山口市', '徳島県': '徳島市',
  '香川県': '高松市', '愛媛県': '松山市', '高知県': '高知市', '福岡県': '福岡市',
  '佐賀県': '佐賀市', '長崎県': '長崎市', '熊本県': '熊本市', '大分県': '大分市',
  '宮崎県': '宮崎市', '鹿児島県': '鹿児島市', '沖縄県': '那覇市'}

for k in range(35):
    q_file = open(f'Test{k+1}.txt','w')
    ans_file = open(f'Ans{k+1}.txt','w')
    q_file.write('県庁所在地クイズ！!\n名前:\n日付:\n')
    ken = [i for i in capitals.keys()]
    random.shuffle(ken)
    for j in range(47):
        r_ans = capitals[ken[j]]
        w_ans = [i for i in capitals.values() if i != capitals[ken[j]]]
        op = ([r_ans] + random.sample(w_ans,3))
        random.shuffle(op)
        op2 = {0: 'A', 1: 'B', 2: 'C', 3: 'D'}
        q_file.write(f'{ken[j]}の県庁所在地は?\n' + '\n'.join([f'{op2[op.index(o)]}:{o}' for o in op]) + '\n\n')
        ans_file.write(f'第{j}問目の解答:{op2[op.index(r_ans)]}:{op[op.index(r_ans)]}\n')

